/**
 * Работаем с переменными
 *
 * Выражение 'var' для объявления переменных устарело, использованеие не рекомендуется.
 * В зависимости от выбранного выражениия var и let у переменной может отличаться область видимости.
 * Выражение const говорит о том, что объявленная переменная более не может изменяться, и данная переменная не может быть не проинициализирована!
 */

const URL = "www.google.com";

var firstName = "Kostantin";
let lastName = "Volkov";
let age = 31;
let person = { name: "Konstantin", age: 31 };
var array = [1, 2, 3, 4, 5];

console.log(person);
